# Merge and Concat

In [27]:
import pandas as pd

In [28]:
var1 = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,8,9,10]})
var2 = pd.DataFrame({"a":[1,2,3,4,5],"c":[26,27,28,29,30]})

print(pd.merge(var1,var2, on='a'))

   a   b   c
0  1   6  26
1  2   7  27
2  3   8  28
3  4   9  29
4  5  10  30

In [29]:
var1 = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,8,9,10]})
var2 = pd.DataFrame({"a":[1,2,3,4,9],"c":[26,27,28,29,30]})

print(pd.merge(var1,var2, how='left'))  # by default how='inner'

   a   b     c
0  1   6  26.0
1  2   7  27.0
2  3   8  28.0
3  4   9  29.0
4  5  10   NaN

In [30]:
var1 = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,8,9,10]})
var2 = pd.DataFrame({"a":[1,2,3,4,9],"b":[26,27,28,29,30]})

print(pd.merge(var1,var2, left_index=True, right_index=True))

   a_x  b_x  a_y  b_y
0    1    6    1   26
1    2    7    2   27
2    3    8    3   28
3    4    9    4   29
4    5   10    9   30

In [31]:
print(pd.merge(var1,var2, left_index=True, right_index=True, suffixes=("name", "python")))

   aname  bname  apython  bpython
0      1      6        1       26
1      2      7        2       27
2      3      8        3       28
3      4      9        4       29
4      5     10        9       30

# Concatenation

In [32]:
sr1 = pd.Series([2,4,6,8,10])
sr2 = pd.Series([12,14,16,18,20])

pd.concat([sr1, sr2])

0     2
1     4
2     6
3     8
4    10
0    12
1    14
2    16
3    18
4    20
dtype: int64

In [33]:
var1 = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,8,9,10]})
var2 = pd.DataFrame({"a":[1,2,3,4,9],"b":[26,27,28,29,30]})

pd.concat([var1, var2])

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10
0  1  26
1  2  27
2  3  28
3  4  29
4  9  30

In [34]:
pd.concat([var1, var2], axis=1) # merge according to column

   a   b  a   b
0  1   6  1  26
1  2   7  2  27
2  3   8  3  28
3  4   9  4  29
4  5  10  9  30

In [38]:
var1 = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,8,9,10]})
var2 = pd.DataFrame({"a":[1,2,3,4,None ],"b":[26,27,28,None ,None ]})

pd.concat([var1, var2], axis=1, join='inner') # merge according to column

   a   b    a     b
0  1   6  1.0  26.0
1  2   7  2.0  27.0
2  3   8  3.0  28.0
3  4   9  4.0   NaN
4  5  10  NaN   NaN

In [39]:
var1 = pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,8,9,10]})
var2 = pd.DataFrame({"a":[1,2,3,4,None ],"b":[26,27,28,None ,None ]})

pd.concat([var1, var2], axis=1, join='inner', keys=['d1','d2'])

  d1       d2
   a   b    a     b
0  1   6  1.0  26.0
1  2   7  2.0  27.0
2  3   8  3.0  28.0
3  4   9  4.0   NaN
4  5  10  NaN   NaN

In [40]:
pd.concat([var1, var2], axis=0, join='inner', keys=['d1','d2'])

        a     b
d1 0  1.0   6.0
   1  2.0   7.0
   2  3.0   8.0
   3  4.0   9.0
   4  5.0  10.0
d2 0  1.0  26.0
   1  2.0  27.0
   2  3.0  28.0
   3  4.0   NaN
   4  NaN   NaN

In [42]:
var1 = pd.DataFrame({"d":[1,2,3,4,5]})
var2 = pd.DataFrame({"a":[1,2,3,4,None ],"b":[26,27,28,None ,None ]})

pd.concat([var1, var2], axis=1, join='inner', keys=['d1','d2'])

  d1   d2
   d    a     b
0  1  1.0  26.0
1  2  2.0  27.0
2  3  3.0  28.0
3  4  4.0   NaN
4  5  NaN   NaN